-- Лабораторна робота №2
-- Студента групи АнД-31
-- Пивовара Володимира
-- Варіант №9


-- Мета роботи: Набути досвiду визначення рекурсивних функцiй, використання механiзму зiставлення зi зразком i роботи з кортежами та списками.


import Data.List (nub)
-- Завдання:

-- 1. Видалити повтори елементiв списку (список - множина), напр.: [1,1,1,5,5,3,1,1,222,222,222,222] ⇒ [1,5,3,222]

-- 1.1 - Без застосування вбудованих функцій:

-- Допоміжна функція з рекурсією
f11_1 :: [Int] -> Int -> Int -> [Int]
f11_1 x i j =
	if j >= length x then x
	else if i >= length x then f11_1 x (j+2) (j+1)
	else if x!!j /= x!!i then f11_1 x (i+1) j
	else f11_1 ((take i x) ++ reverse (take ((length x) - (i+1)) (reverse x))) (j+1) j

f11 :: [Int] -> [Int]
f11 x =
	if length x <= 1 then x
	else f11_1 x 1 0


-- 1.2 - Із застосування вбудованих функцій:

f12 :: [Int] -> [Int]
f12 x = nub x



-- 2. Знайти найменше спiльне кратне двох чисел

-- 1.1 - Без застосування вбудованих функцій:

-- Допоміжна функція з рекурсією
f21_1 :: Int -> Int -> Int -> Int
f21_1 x y z =
	if (mod z x == 0) && (mod z y == 0) then z
	else f21_1 x y (z+1)

f21 :: Int -> Int -> Int
f21 x y = f21_1 x y (max x y)


-- 1.2 - Із застосування вбудованих функцій:

f22 :: Int -> Int -> Int
f22 x y = lcm x y